app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def authenticate_user!
        # since concentrating more on job level things just handled user in a basic manner
        user_id = request.headers['user_id'] || params[:user_id] || 1 #"QmhhcmF0aDox"
        # begin
        #     dec_user_id = Base64.decode64(user_id).split(":").last
        # rescue ArgumentError
        #     render json: { error: "Please Enter Valid Encoded User-Id" }, status: :bad_request and return
        # end

        # if dec_user_id.blank?
        #     render json: { error: "Please Enter Valid Encoded User-Id" }, status: :bad_request and return
        # end

        # @current_user = User.find_by(id: dec_user_id)
        @current_user = User.find_by(id: user_id)